package parser

import (
	"disp_bot/utils"
	"reflect"
	"testing"
)

/*
Диспетчер1, [29.06.2023 22:23]
АВТО ЛИГА. ул Кулаков пер.д 6
1  ;к293еа790/XW8ZZZ61ZLG026098/Polo/134 234/У авто сломан замок багажника, удалось багажник закрыть и он не открывается. Горит индикация открытого багажника и авто не закрывается;
2  ;н102мс797/LVTDB21B4ND333680/LX/9 906/масло вытекло, мотор предыдущий бзер заводил в таком состоянии;
АВТОЛАЙТ.Полбина 29,с1
1  ;т637мх797/XZGEE04A0NA820320/Jolion/40 832/Переднее окно не реагирует на нажатие кнопки все окна работают кроме водительского,при нажатии на кнопку щелкает но не опускает и не поднимает;
АВТОЛАЙТ.Прокатная д7
1  ;о791му797/LVVDB21B5ND719807/Tiggo 7 Pro/31 789/замена блока;
2  ;о828му797/LVVDB21B8ND723107/Tiggo 7 Pro/30 002/замена блока;
3  ;р335ме797/LVVDB21B6ND722991/Tiggo 7 Pro/31 634/замена блока;
АСЦ Дубровка.Geely Exeed Chery.2яМашиностроения.д6
1  ;е022нм799/LVTDB21B9ND288512/LX/25 229/Плановое ТО;
2  ;е371нн797/LVTDB21B4ND289812/LX/24 996/Плановое ТО;
3  ;н580мм797/Y4K8622ZXPB905047/Coolray/11 907/Плановое ТО;
4  ;о153мх797/Y4K8622Z0PB905199/Coolray/11 196/Плановое ТО;
5  ;о377мх797/LVTDB21B0ND090708/LX/27 453/Плановое ТО;
6  ;с156на797/Y4K8622Z9PB905041/Coolray/11 092/Плановое ТО;
7  ;с325му797/LVTDD21BXND147927/TXL/31 980/Плановое ТО;
8  ;с987мв797/Y4K8622Z2NB909090/Coolray/37 072/Плановое ТО;
9  ;х252не797/LVTDD21B1ND273898/TXL/24 444/Плановое ТО;
10  ;х655нн797/Y4K8622Z3NB908725/Coolray/25 916/Плановое ТО;
Казаков Моторс.Костомаровская наб.д.29А
1  ;е341нт790/Z94C251ABMR151806/Rio X/94 148/;
2  ;к122хс750/Z94C251ABKR064441/Rio X-Line/148 424/;
3  ;к884ек790/Z94C251ABLR100024/Rio X-Line/134 848/Замена колодок (Остаток ПТК = 5, Остаток ЗТК = 0);
4  ;м403ек790/Z94C251ABLR099767/Rio X-Line/133 078/;
5  ;н083рв799/XW8ZZZ61ZLG007801/Polo/156 063/;
6  ;н976нх799/Z94C251ABKR052512/Rio X-Line/157 305/;
7  ;о072ем790/Z94C251ABLR117516/Rio X-Line/130 982/Замена колодок (Остаток ПТК = 3, Остаток ЗТК = 0);
8  ;о352ее790/Z94C251ABLR101672/Rio X-Line/117 576/Замена колодок (Остаток ПТК = 5,2, Остаток ЗТК = 0);
9  ;о884св799/Z94C251ABLR067103/Rio X-Line/161 542/;
10  ;р448нт790/Z94C251ABMR157183/Rio X/97 489/;
11  ;с692нх790/Z94C251ABMR148749/Rio X/97 960/;
12  ;у188нс790/Z94C251ABMR151515/Rio X/99 691/;
13  ;у790ев790/Z94C251ABLR102360/Rio X-Line/127 923/;
14  ;х198вх790/Z94C251ABLR101192/Rio X-Line/130 781/Замена колодок (Остаток ПТК = 4,7, Остаток ЗТК = 0);
15  ;х680мс797/XZGEE04A6NA819317/Jolion/37 991/Замена колодок (Остаток ПТК = 3,7, Остаток ЗТК = 0);
КЛЮЧ-АВТО КИТАЙ. Кипарисовая 16/1. СОЧИ
1  ;р866мм797/LVVDB21B2ND234444/Tiggo 4/33 802/Плановое ТО;
МЭЙДЖОР CHERRY. Цветочный прзд д 17
1  ;е746нс790/Z94C251ABMR156902/Rio X/95 370/Плановое ТО;
2  ;к026нр790/Z94C251ABMR161189/Rio X/87 169/Плановое ТО;
3  ;к036нт797/XZGEE04A4NA823334/Jolion/11 113/Плановое ТО;
4  ;к218рн799/Z94C251ABKR063131/Rio X-Line/161 646/Плановое ТО;
5  ;к309рн799/Z94C251ABKR062809/Rio X-Line/141 869/Плановое ТО;
6  ;к459рн799/Z94C251ABKR063019/Rio X-Line/135 389/Плановое ТО;
7  ;м037мв797/LVTDB21B8ND336162/LX/9 665/Плановое ТО;
8  ;н362нт790/Z94C251ABMR160340/Rio X/86 260/Плановое ТО;
9  ;о296мс797/LVVDB21BXND719821/Tiggo 7 Pro/29 559/Плановое ТО;
10  ;р997мк797/LVVDB21B4PD951169/Tiggo 4/11 752/Плановое ТО;
11  ;т089мт797/XZGEE04A0NA820317/Jolion/35 922/Плановое ТО;
12  ;т471ео790/Z94C251ABLR117732/Rio X-Line/135 657/Плановое ТО;
13  ;у439мк797/LVTDB21B3ND159018/LX/32 474/Плановое ТО;
14  ;х898св790/LVVDB21B0MD293376/Tiggo 4/48 868/Плановое ТО;
МЭЙДЖОР KIA VW HAVAL .47 км МКАД
1  ;а626мс797/XZGEE04A9NA818873/Jolion/45 664/Плановое ТО;
2  ;в383ну790/Z94C251ABMR142941/Rio X/111 745/Плановое ТО;
3  ;в392ма797/XZGEE04A0NA821368/Jolion/44 525/Плановое ТО;
4  ;к266рн799/Z94C251ABKR063014/Rio X-Line/161 357/Плановое ТО;
5  ;к293ен790/XW8ZZZ61ZLG026523/Polo/130 082/Плановое ТО;
6  ;к332ее790/XW8ZZZ61ZLG026526/Polo/136 323/Плановое ТО;

Диспетчер1, [29.06.2023 22:23]
7  ;к340ет790/XW8ZZZ61ZLG025064/Polo/135 373/Плановое ТО;
8  ;к397нс797/XZGEE04A3NA822370/Jolion/27 987/Плановое ТО;
9  ;к498еу790/XW8ZZZ61ZLG026518/Polo/136 735/Плановое ТО;
10  ;к755нх797/XZGEE04A7NA822744/Jolion/28 645/Плановое ТО;
11  ;к766нр797/XZGEE04A3NA820084/Jolion/29 067/Плановое ТО;
12  ;к836ее790/Z94C251ABLR098492/Rio X-Line/128 135/Плановое ТО;
13  ;н206нс790/Z94C251ABMR151501/Rio X/105 233/Плановое ТО;
14  ;о431нт790/Z94C251ABMR152282/Rio X/100 137/Плановое ТО;
15  ;о469ну790/Z94C251ABMR149187/Rio X/87 169/Плановое ТО;
16  ;о658ер790/Z94C251ABLR117950/Rio X-Line/132 290/Плановое ТО;
17  ;о955нр790/Z94C251ABMR153763/Rio X/97 530/Плановое ТО;
18  ;р303ср799/Z94C251ABLR072403/Rio X-Line/147 963/Плановое ТО;
19  ;т114ек790/Z94C251ABLR115241/Rio X-Line/130 729/Плановое ТО;
20  ;т400ее790/Z94C251ABLR103822/Rio X-Line/131 605/Плановое ТО;
21  ;х185вх790/Z94C251ABLR101191/Rio X-Line/134 294/Плановое ТО;
22  ;х262еа790/Z94C251ABLR100459/Rio X-Line/130 672/Плановое ТО;
23  ;х365нс790/Z94C251ABMR151491/Rio X/99 096/Плановое ТО;
перегонщик
1  ;х516мт797/XZGEE04A0NA823878/Jolion/28 683/Прошивка блока SRS;
СТО ШИКАНА.Хлебозаводский проезд 7А
1  ;о352ее790/Z94C251ABLR101672/Rio X-Line/117 636/самопроизвольная активация печки;
2  ;у973мс797/LVTDB21B6ND081611/LX/30 687/кипела и со слов очевидцев были проблемы с электрикой моргало;
ЦКР-АВТО. Перерва д19,с2
1  ;к429рн799/Z94C251ABKR063020/Rio X-Line/162 546/колодки;
2  ;н028рв799/XW8ZZZ61ZLG007713/Polo/132 406/не горит задний правый габарит, контакты в плохом состоянии , оломан поводок вод дворника;
*/

func TestParser_oneC(t *testing.T) {
	text1 := "АВТО ЛИГА. ул Кулаков пер.д 6\n" +
		"1  ;к293еа790/XW8ZZZ61ZLG026098/Polo/134 234/ 47 47 47 У авто сломан замок багажника, удалось багажник закрыть и он не открывается. Горит индикация открытого багажника и авто не закрывается;\n" +
		"2  ;н102мс797/LVTDB21B4ND333680/LX/9 906/масло вытекло, мотор предыдущий бзер заводил в таком состоянии;\n" +
		"АВТОЛАЙТ.Полбина 29,с1\n" +
		"1  ;т637мх797/XZGEE04A0NA820320/Jolion/40 832/Переднее окно не реагирует на нажатие кнопки все окна работают кроме водительского,при нажатии на кнопку щелкает но не опускает и не поднимает;\n" +
		"МЭЙДЖОР KIA VW HAVAL .47 км МКАД\n" +
		"1  ;а626мс797/XZGEE04A9NA818873/Jolion/45 664/Плановое ТО;\n" +
		"2  ;в383ну790/Z94C251ABMR142941/Rio X/111 745/Плановое ТО;\n"
	text2 := "7  ;к340ет790/XW8ZZZ61ZLG025064/Polo/135 373/Плановое ТО;\n"

	type args struct {
		messages []utils.Message
	}
	tests := []struct {
		name       string
		args       args
		wantTo     map[string]utils.Message
		wantRepair map[string]utils.Message
	}{
		{
			name: "",
			args: args{messages: []utils.Message{{Text: text1}, {Text: text2}}},
			wantTo: map[string]utils.Message{
				"а626мс797": {
					Loc:  "47",
					Text: "text from 1C",
					Mark: "а626мс797",
				},
				"в383ну790": {
					Loc:  "47",
					Text: "text from 1C",
					Mark: "в383ну790",
				},
				"к340ет790": {
					Loc:  "47",
					Text: "text from 1C",
					Mark: "к340ет790",
				},
			},
			wantRepair: map[string]utils.Message{
				"к293еа790": {
					Loc:  "кулак",
					Mark: "к293еа790",
					Text: "text from 1C",
				},
				"н102мс797": {
					Loc:  "кулак",
					Mark: "н102мс797",
					Text: "text from 1C",
				},
				"т637мх797": {
					Loc:  "полбина",
					Mark: "т637мх797",
					Text: "text from 1C",
				},
			},
		},
	}

	p := Init()
	for _, tt := range tests {
		t.Run(tt.name, func(t *testing.T) {
			gotTo, gotRepair := p.oneC(tt.args.messages)
			if !reflect.DeepEqual(gotTo, tt.wantTo) {
				t.Errorf("oneC() gotTo = %v, want %v", gotTo, tt.wantTo)
			}
			if !reflect.DeepEqual(gotRepair, tt.wantRepair) {
				t.Errorf("oneC() gotRepair = %v, want %v", gotRepair, tt.wantRepair)
			}
		})
	}
}

func TestParser_rewriteLocation(t *testing.T) {
	type args struct {
		str      string
		location string
	}
	tests := []struct {
		name string
		args args
		want string
	}{
		{
			name: "",
			args: args{
				str:      "jwehkfjwejf",
				location: "42",
			},
			want: "42",
		},
		{
			name: "",
			args: args{
				str:      "42vfvf",
				location: "42",
			},
			want: "42",
		},
		{
			name: "",
			args: args{
				str:      "цветочный",
				location: "42",
			},
			want: "цветок",
		},
	}

	p := Init()
	for _, tt := range tests {
		t.Run(tt.name, func(t *testing.T) {
			if got := p.rewriteLocation(tt.args.str, tt.args.location); got != tt.want {
				t.Errorf("rewriteLocation() = %v, want %v", got, tt.want)
			}
		})
	}
}
